{
    "data": [
        {
            "id": "Introduction",
            "text": "2024년 초보자를 대상으로 한 머신러닝 과정은 경력 경로 및 초보자 친화적 이론에 중점을 둔 2024년 머신러닝 로드맵으로 시작한다. 과정은 Python을 사용한 실습적 적용과 종합적인 프로젝트로 이어진다. 이 과정은 데이터 과학 전문가인 Todd가 만들었다. 그녀의 목적은 머신러닝 개념을 해독하여 초보자에게 접근 가능하고 실행 가능하게 만들고, 기존 교육 자원에서의 격차를 메우며, 머신러닝 분야의 발전에 따른 성공 경로를 설정하는 것이다. 이 소개 과정은 머신러닝의 기초를 다루고, 실제 세계 사례 연구를 통해 그것을 실습에 적용한다. Lunar Tech의 창립자인 Todd Havassan은 데이터 과학과 AI를 개인과 기업에 보다 접근 가능하게 만들고 있다. 머신러닝, 딥러닝, 데이터 과학 또는 AI 자원을 찾고 있다면 LunarTech.AI의 무료 자원 섹션 또는 YouTube 채널을 확인하여 더 많은 콘텐츠를 찾고 머신러닝 및 AI에 뛰어들 수 있다. 머신러닝 로드맵으로 시작하여 머신러닝에 들어가기 위해 필요한 정확한 기술 세트를 논의할 것이다. 이론을 배우고 머신러닝 로드맵을 살펴본 후, 이론을 실습에 적용한다. 선형 회귀 모델을 구현하는 기본적이지만 강력한 케이스 스터디를 수행한다. 캘리포니아 주택 가격에 대한 인과 분석과 예측 분석 모두에 해당 모델을 사용한다. 캘리포니아 주택 가치를 주도하는 특징을 파악하고 실제 세계 데이터 과학 프로젝트를 수행하는 단계별 접근 방법을 논의한다. 이 과정을 마치면 2024년 머신러닝 로드맵, 머신러닝 및 데이터 과학에 들어가기 위해 사용할 수 있는 정확한 기술 세트 및 행동 계획을 알게 된다. 머신러닝의 기초를 배우고 실제 머신러닝 프로젝트에 구현한다.",
            "timestamp": "000000",
            "summarization": "초24년 초보자를 대상으로 한 머신러닝 과정은 경력 경로 및 초보자 친화적 이론에 중점을 둔 로드맵으로 시작하는데 초보자에게 접근 가능하고 실행 가능하게 만들고, 기존 교육 자원에서의 격차를 메우며, 머신러닝 분야의 발전에 따른 성공 경로를 설정하는 것을 목적으로 하며 초보자 친화적 이론에 중점을 둔 로드맵으로 시작한다."
        },
        {
            "id": "Machine Learning Roadmap for 2024",
            "text": "2024년 기계 학습 분야에 진입하기 위해 필요한 기술, 학습해야 할 주제, 진행해야 할 프로젝트 예시, 이력서 추가용 포트폴리오 프로젝트, 기계 학습 관련 직종 및 산업군, 예상 평균 급여 등에 대해 논의될 예정입니다. 기계 학습이란 데이터를 기반으로 모델을 구축하고 이를 통해 다양한 결정을 내리는 인공 지능(AI)의 한 분야로, 의료부터 엔터테인먼트에 이르기까지 다양한 산업에서 활용되어 고객 경험 향상, 고객 행동 식별, 기업 매출 증진 및 정부 의사 결정 지원 등에 기여합니다. 특히, 의료 분야에서는 질병 진단, 약물 발견, 개인 맞춤형 의학 등에 활용되고 금융 부문에서는 사기 탐지, 트레이딩, 수요 예측, 영업 최적화 등에 응용되며, 소매업에서는 수요 예측, 창고 최적화, 추천 시스템 및 검색 엔진 구축에 이용됩니다. 마케팅에서는 고객 타겟팅 효율성 증대에, 자율 주행 차량과 자연어 처리, 스마트 홈 장치, 농업에서는 작물 수확 최적화, 토양 건강 모니터링에 그리고 엔터테인먼트 분야에서는 개인 맞춤형 추천 시스템 개발에 기여합니다. 기계 학습의 응용 범위는 넓으며 향후 10년 내 지속적으로 성장할 것으로 예상되는 중요하고 강력한 분야입니다.",
            "timestamp": "000313",
            "summarization": "향후 10년 내 지속적으로 성장할 것으로 예상되는 기계 학습 응용 범위가 넓으며 향후 10년 내 지속적으로 성장할 것으로 예상되는 중요하고 강력한 분야로 응용 범위는 넓으며 향후 10년 내 지속적으로 성장할 것으로 예상되는 중요하고 강력한 분야로 응용 범위는 넓으며 향후 10년 내 지속적으로 성장할 것으로 예상되는 중요하고 강력한 분야다."
        },
        {
            "id": "Must Have Skill Set for Career in Machine Learning",
            "text": "기계학습 분야에 진입하려는 결정을 함에 따라, 수학적 기초와 프로그래밍 언어 파이썬, 통계학, 기계학습 및 자연어 처리(NLP)에 대한 지식이 필수적임을 인식해야 한다. 수학적 기초로는 선형대수학, 미분, 적분, 이산수학 등이 포함되며, 이는 기계학습 알고리즘의 이해를 위해 필수적이다. 통계학에서는 기술 통계, 다변량 통계, 추론 통계, 확률 분포와 같은 개념을 숙지해야 하며, 이는 데이터 분석과 기계학습 모델의 성능 분석에 중요하다. 기계학습 기초로는 지도학습, 비지도학습, 강화학습과 같은 학습 유형의 이해와 선형 회귀, 로지스틱 회귀, 결정 트리, 랜덤 포레스트, K-NN 등과 같은 알고리즘의 운용 방법을 아는 것이 중요하다. 프로그래밍 언어로서 파이썬은 기계학습 프로젝트 구현에 있어 주요 도구로, 라이브러리 이해와 데이터 구조, 알고리즘 방식의 활용이 요구된다. NLP 분야에서는 텍스트 데이터 처리, 정제, 토큰화, 임베딩 등의 기초적인 개념과 함께 자연어 처리의 다양한 기법에 대한 이해가 필요하다. 성공적인 기계학습 진입을 위해서는, 추천 시스템 구축, 회귀 모델 개발, 분류 모델 구현, 비지도 학습을 통한 클러스터링 같은 다양한 실제 프로젝트를 완성하는 것이 중요하며, 이를 통해 기계학습의 폭넓은 영역에 대한 경험과 전문성을 증명할 수 있다. 추가적으로, 고급 기계학습 기술과 생성적 AI, 대규모 언어 모델에 대한 지식을 습득하고, 이를 실전 프로젝트에 적용함으로써, 중급 또는 고급 기계학습 직위에서 요구되는 전문성을 키울 수 있다.",
            "timestamp": "001039",
            "summarization": "고학습 분야에 진입하려는 결정을 함에 따라 수학적 기초와 프로그래밍 언어 파이썬, 통계학, 기계학습 및 자연어 처리(NLP)에 대한 지식이 필수적임을 인식해야 하며 고급 기계학습 기술과 생성적 AI, 대규모 언어 모델에 대한 지식을 습득하고, 이를 실전 프로젝트에 적용함으로써, 중급 또는 고급 기계학습 직위에서 요구되는 전문성을 키울 수 있다."
        },
        {
            "id": "Machine Learning Common Career Paths",
            "text": "기계학습 분야에서 경력을 쌓고자 하는 개인은 다양한 업무 직위를 기대할 수 있으며, 기계학습 연구원, 기계학습 엔지니어, AI 연구 엔지니어 등의 직책이 존재한다. 기계학습 연구원은 학술적 배경을 가진 개인이 주로 수행하며, 기계학습 알고리즘의 연구, 훈련, 테스트, 평가 등을 담당한다. 기계학습 엔지니어는 기계학습 기술을 공학적 기술과 결합하여, 모델의 생산, 파이프라인 구축, 모델 성능 및 확장성 고려 등의 업무를 수행한다. AI 연구 및 AI 엔지니어링 직위는 트래디셔널 기계학습과 다르게 보다 고급 기계학습에 초점을 맞추며, 딥러닝 모델, 컴퓨터 비전, 생성적 AI 모델 등을 다룬다. 또한 NLP 연구, NLP 엔지니어, 데이터 과학 직위도 있으며, 이러한 직위에서는 기계학습 지식이 필수적이다. 기계학습 또는 AI 분야 직위 준비를 위해 LunarTech.ai에서 제공하는 다양한 온라인 코스 및 자료를 활용할 수 있으며, 기계학습 기초, NLP 기초, 파이썬 기초 등을 학습할 수 있다. 또한 GitHub 및 LinkedIn을 통해 다양한 프로젝트와 케이스 스터디에 접근하여 기계학습 기술을 연습하고 이를 이력서에 추가할 수 있다.",
            "timestamp": "003854",
            "summarization": "기계학습 분야에서는 학술적 배경을 가진 개인이 주로 수행하며, 기계학습 알고리즘의 연구, 훈련, 테스트, 평가 등을 담당하고 기계학습 엔지니어는 기계학습 기술을 공학적 기술과 결합하여, 모델의 생산, 파이프라인 구축, 모델 성능 및 확장성 고려 등의 업무를 수행하기 때문에 다양한 업무 직위를 기대할 수 있으며, 기계학습 연구원, 기계학습 엔지니어, AI 연구 엔지니어 등의 직책이 존재한다."
        },
        {
            "id": "Machine Learning Basics",
            "text": "기계학습의 기초 개념은 대화를 이해하고 기계학습을 사용하여 주요 문제를 해결하는 데 필요하며, 기계학습의 기초에 대한 확실한 이해는 기계학습에 대해 더 알아보거나 기계학습으로 작업하고자 하는 사람에게 중요한 단계입니다. 지도학습과 비지도학습 모델 간의 차이를 정의하고 살펴볼 것이며, 회귀 및 분류 유형의 기계학습 모델 간의 차이점을 살펴볼 것입니다. 그 후, 기계학습 모델을 처음부터 훈련하는 과정과 성능 메트릭 또는 QKU를 도입하여 모델을 평가하는 방법을 살펴볼 것입니다. 지도학습과 비지도학습, 회귀 대 분류 문제 유형에 관계없이 모델 또는 문제 유형에 따라 성능 메트릭을 도입하여 평가하는 방법에 대해 설명할 것입니다. 지도학습 알고리즘은 레이블이 지정된 예시에 의해 안내되는 반면, 비지도 학습 알고리즘은 레이블 없는 데이터에 대해 패턴과 관계를 찾아야 합니다. 회귀 알고리즘은 연속적인 값을 예측하는 반면, 분류 알고리즘은 범주화된 값을 예측합니다. 회귀 모델 평가에는 잔차 제곱합(RSS), 평균 제곱 오차(MSE), 제곱근 평균 제곱 오차(RMSE), 평균 절대 오차(MAE) 등이 포함되며, 분류 모델 평가에는 정확도, 정밀도, 재현율, F1 점수가 포함됩니다. 비지도학습 모델의 성능 평가는 클러스터 내 데이터 포인트의 유사성과 서로 다른 클러스터 간 데이터 포인트의 비유사성을 측정하는 메트릭을 사용합니다. 기계학습 모델을 평가하는 단계별 프로세스는 데이터 준비에서 시작하여 알고리즘 선택, 모델 훈련, 하이퍼파라미터 튜닝을 거쳐 모델 평가로 이어집니다. 이 과정을 통해 새롭고 본 적 없는 데이터에 대한 모델의 일반화 성능을 파악할 수 있으며, 최적의 모델을 통해 테스트 데이터에 대한 예측을 수행하고 실제 값과 예측 값 사이의 성능 메트릭을 계산하여 모델의 성능을 평가할 수 있습니다.",
            "timestamp": "004548",
            "summarization": "기계학습과 비지도학습 모델 간의 차이는 지도학습과 비지도학습 모델 간의 차이를 정의하고 살펴볼 것이며, 회귀 및 분류 유형의 기계학습 모델 간의 차이점을 살펴볼 것이고, 기계학습 모델을 처음부터 훈련하는 과정과 성능 메트릭 또는 QKU를 도입하여 모델을 평가하는 방법을 살펴보며, 지도학습과 비지도학습, 회귀 대 분류 문제 유형에 관계없이 모델 또는 문제 유형에 따라 성능 메트릭을 도입하여 평가하는 방법에 대해 설명할 것입니다."
        },
        {
            "id": "Bias-Variance Trade-Off",
            "text": "통계학 혹은 기계 학습 모델을 고려하고 적용하기 전에 알아야 할 중요 개념으로 모델의 편향성과 모델의 변동성 그리고 두 요소 간의 균형을 말하는 편향-변동성 트레이드오프가 있다. 모델을 사용할 때마다 단순하더라도 모델의 오류율을 평가하는 것이 중요하다. 모델 선택과 성능에 있어 항상 고려해야 할 점은 모델의 변동성과 모델의 편향성 사이에서 이루어지는 트레이드오프이다. 모델의 편향성은 모델이 데이터 내의 진정한 관계를 포착하지 못하는 능력을 의미하며, 진정한 관계를 감지할 수 있는 기계 학습 모델은 편향성이 낮다. 복잡하거나 유연한 모델은 단순한 모델보다 편향성이 낮은 경향이 있다. 반면, 모델의 변동성은 서로 다른 데이터 세트에 모델을 적용할 때 모델 성능의 일관성 수준이나 변동성을 의미한다. 복잡하거나 유연한 모델은 단순한 모델보다 변동성이 높은 경향이 있다. 모델의 성능을 평가하기 위해서는 모델이 만들어내는 오류량을 살펴보아야 한다. 이는 모델의 예측값과 실제 테스트 값 사이의 기대되는 제곱 차이로, 오류율을 모델의 변동성, 모델의 제곱 편향성 및 감소시킬 수 없는 오류로 분해할 수 있다. 감소시킬 수 있는 오류와 감소시킬 수 없는 오류로 구성되며, 기계 학습 모델이 F를 추정하는 가장 적합한 모델과 그것의 최적 버전을 사용하여 F의 정확성을 potencially 향상시킬 수 있기 때문에 이 오류는 감소시킬 수 있다. 예측의 정확성은 예측된 응답의 형태가 F와 동일하게 추정될 수 있다 하더라도, Y가 오차율 엡실론의 함수로서, 우리의 특징 X를 사용하여 예측될 수 없는 정의에 의해 항상 일부 오류가 존재하기 때문에, 감소시킬 수 없는 오류로 인해 여전히 일부 오류가 발생한다. 최적의 기계 학습 방법을 선택함으로써 기대되는 테스트 오류율을 최소화하려고 하는 것이 바로 편향-변동성의 교환 관계이며, 모델의 편향성과 변동성 사이에는 부정적 상관관계가 있음을 명심해야 한다. 기계 학습 모델의 유연성은 그것의 변동성과 편향성에 직접적인 영향을 미친다는 것을 알 수 있다. 이 주제에 대해 생각하면서, 과적합 문제를 해결하기 위해 정규화를 사용하는 방법을 논의할 다음 강의에서 이 주제를 계속할 것이다.",
            "timestamp": "010059",
            "summarization": "모델의 변동성과 모델의 편향성 사이에서 이루어지는 트레이드오프 오류율을 평가하고 최적의 기계 학습 방법을 선택함으로써 기대되는 테스트 오류율을 최소화하려고 하는 것이 바로 편향-변동성의 교환 관계이며, 모델의 편향성과 변동성 사이에는 부정적 상관관계가 있음을 명심해야 한다."
        },
        {
            "id": "Overfitting and Regularization",
            "text": "과다적합이라는 중요 개념과 이를 해결하기 위한 다양한 기법을 포함한 정규화 기법의 사용에 관하여 논의되었고, 이는 과거 강의 및 모델 오류, 훈련 오류율, 테스트 오류율, 모델의 편향 및 분산과 같은 이슈와 관련있다. 과다적합은 특히 정규화를 통해 해결방안을 알아야 하는 중요한 주제이며, 이는 모델의 부정확한 예측과 새로운 데이터에 대한 일반화 부족으로 이어질 수 있다. 과다적합을 감지하고 예방하는 방법을 아는 것은 효과적인 머신 러닝 모델을 구축하는 데 있어 필수적이다. 모델 유연성과 분산, 편향 간의 관계에 대해 논의되었으며, 모델의 유연성이 증가함에 따라 참된 패턴을 데이터에서 더 쉽게 찾을 수 있으나 동시에 해당 모델의 분산이 증가한다는 것이 관찰되었다. 과다적합과 과소적합을 공식적으로 정의하였으며, 과다적합은 훈련 데이터에서는 성능이 우수하지만 테스트 데이터에서 성능이 떨어지는 경우를 의미한다. 과다적합은 너무 많은 특성, 복잡한 모델, 또는 너무 적은 데이터 때문에 발생할 수 있다. 모델이 과다적합할 때 높은 분산과 낮은 편향을 가진다. 과다적합 문제를 해결하기 위한 여러 방법으로는 모델의 복잡성을 줄이기, 더 많은 데이터 수집하기, 리샘플링 기법 사용하기, 조기 종료 기법 적용하기, 앙상블 방법 사용하기 및 드롭아웃 적용하기 등이 있다. 정규화는 페널티를 적용하여 모델의 분산을 크게 감소시키면서 모델에 약간의 편향을 도입하는 방식으로 과다적합 문제를 해결하는 기법으로, L1 정규화, L2 정규화(릿지 회귀), 그리고 딥러닝에서 사용되는 드롭아웃이 포함된다. 릿지 회귀(L2 정규화)는 모델 계수를 0에 가깝게 축소함으로써 과대적합을 해결하고, 라쏘 회귀(L1 정규화)는 일부 모델 계수를 정확히 0으로 설정하여 과대적합 문제를 해결하고, 이와 동시에 변수 선택 기능을 수행한다.",
            "timestamp": "010804",
            "summarization": "성다적합이라는 중요 개념과 이를 해결하기 위한 다양한 기법을 포함한 정규화 기법의 사용에 관하여 논의되었고, 이는 과거 강의 및 모델 오류, 훈련 오류율, 테스트 오류율, 모델의 편향 및 분산과 같은 이슈와 관련되었고 정규화는 페널티를 적용하여 모델의 분산을 크게 감소시키면서 모델에 약간의 편향을 도입하는 방식으로 과다적합 문제를 해결하는 기법으로, L1 정규화, L2 정규화(릿지 회귀), 그리고 딥러닝에서 사용되는 드롭아웃이 있다."
        },
        {
            "id": "Linear Regression Basics - Statistical Version",
            "text": "상관관계가 인과관계를 의미하지 않는다는 개념과 이를 판별하기 위해 사용되는 선형 회귀 모델에 대해 논의하였다. 선형 회귀는 단순한 방법으로 여겨지지만, 관심 있는 변수에 영향을 미치거나 통계적으로 유의미한 영향을 가지는 특성을 식별할 수 있는 몇 안 되는 방법 중 하나이다. 이 모델은 독립 변수 값이 변할 때 종속 변수의 변화량을 식별하는 데 도움을 준다. 선형 회귀의 개념을 이해하기 위해서는 종속 변수, 독립 변수, 선형성, 통계적으로 유의미한 영향의 개념을 알고 이해해야 한다. 종속 변수는 측정되거나 테스트되는 변수로, 독립 변수에 의존하여 변한다고 여겨진다. 독립 변수는 실험에서 조작되거나 제어되는 변수로, 종속 변수에 영향을 미친다고 믿어진다. 통계적 유의성은 결과가 우연히 발생했을 가능성이 낮음을 의미한다. 선형 회귀는 독립 변수의 단위 변화가 종속 변수에 미치는 영향을 모델링할 수 있는 통계 또는 기계 학습 방법으로, 두 변수 간의 관계가 선형으로 가정될 때 사용된다. 단일 독립 변수에 기반한 모델을 단순 선형 회귀, 다수의 독립 변수에 기반한 모델을 다중 선형 회귀라고 한다. 모델의 매개변수를 추정하는 방법 중 하나는 최소 제곱 방법이며, 이는 관찰된 종속 변수 값과 모델에 의해 예측된 값 사이의 차이의 제곱합을 최소화함으로써 독립 변수의 선형 함수로부터 최적의 적합선을 찾는 데 사용된다. 이 과정은 모델이 예측한 값과 실제 값 사이의 차이, 즉 잔차를 최소화하여 독립 변수가 종속 변수에 미치는 영향을 찾아내는 것을 목표로 한다.",
            "timestamp": "012338",
            "summarization": "선형 회귀는 단순한 방법으로 여겨지지만, 관심 있는 변수에 영향을 미치거나 통계적으로 유의미한 영향을 가지는 특성을 식별할 수 있는 몇 안 되는 방법 중 하나로, 단일 독립 변수에 기반한 모델을 단순 선형 회귀, 다수의 독립 변수에 기반한 모델을 다중 선형 회귀라고 하며 단일 독립 변수에 기반한 모델을 단순 선형 회귀, 다수의 독립 변수에 기반한 모델을 다중 선형 회귀라고 한다."
        },
        {
            "id": "Linear Regression Model Theory",
            "text": "선형 회귀 모델은 통계 또는 기계 학습 방법으로, 양적인 독립변수의 변화가 다른 목표 변수(의존변수)에 미치는 영향을 모델링 할 수 있도록 하는데, 이때 두 변수 간의 관계가 선형일 때 적용된다. 단순 선형 회귀는 단일 독립변수를 다루며, 다중 선형 회귀는 여러 독립변수를 포함한다. 선형 회귀의 추정치는 최소 제곱법을 사용하여 계산되며, 이는 선형 회귀 모델에서 알려지지 않은 매개 변수를 예측하는 데 사용되는 추정 기술이다. 선형 회귀 모델은 선형성, 샘플의 무작위성, 외생성, 등분산성, 다중공선성 없음 등 다섯 가지 기본 가정을 바탕으로 한다. 선형 회귀 모델의 장점으로는 상대적인 단순성, 다중 독립변수 처리 능력, 고도의 모델링 유연성, 정규화의 쉬운 적용, 다양한 소프트웨어 패키지와 라이브러리 지원 등이 있으며, 단점으로는 강한 가정, 비선형 관계의 경우 예측 부정확성, 오차 항의 정규 분포와 독립성 가정, 이상치에 대한 민감성, 범주형 독립변수 처리의 어려움, 독립변수의 외생성 가정 위반 시 결과 오도 등이 있다.",
            "timestamp": "013656",
            "summarization": "선형 회귀 모델은 단순 독립변수를 다루며 다중 선형 회귀는 여러 독립변수를 포함한 독립변수를 포함한 것이라고 하며 이는 알려지지 않은 매개 변수를 예측하는 데 사용되는 추정 기술로 선형 회귀 모델은 선형성, 샘플의 무작위성, 외생성, 등분산성, 다중공선성 없음 등 다섯 가지 기본 가정을 바탕으로 한다고 한다."
        },
        {
            "id": "Logistic Regression Model Theory",
            "text": "제 5강에서는 로지스틱 회귀(logistic regression)라는 간단하면서도 중요한 분류 모델에 대해 소개한다. 이는 출력이 확률이어야 하는 문제를 다룰 때 유용하다. 로지스틱 회귀는 사회과학, 의학, 공학 등 다양한 분야에서 널리 사용된다. 로지스틱 회귀는 주어진 변수의 데이터 세트에 대한 특정 클래스에 속하는 사건, 관측치의 조건부 확률을 모델링하는 지도 분류 기법이다. 로지스틱 회귀는 두 개의 범주를 가질 수 있지만, 이후 두 클래스를 가질 때 이상적으로 작동하는 것을 배운다. 로지스틱 회귀는 두 변수 간의 관계가 선형일 때, 종속 변수가 범주형 변수일 때, 변수를 확률의 형태로 예측하고자 할 때 유용하다. 로지스틱 회귀는 예측 과정 중에 각 관측치가 특정 클래스에 속할 확률을 예측한다. 로지스틱 회귀는 응답 변수를 예측하는 대신 특정 범주에 속하는 확률을 모델링한다. 로지스틱 회귀는 로그 확률을 예측하며, 독립 변수의 계수는 독립 변수가 한 단위 변경될 때 로그 확률의 변화를 나타낸다. 로지스틱 회귀에서 중요한 개념은 가능도(likelihood) 함수다. 가능도 함수는 관찰된 데이터 주어진 모델의 매개변수를 추정하는 데 사용된다. 가능도 함수는 관찰된 데이터의 확률을 설명하며, 버누이(PMF) 분포에 기반한 것이다. 최대 가능도 추정은 주어진 입력 데이터 및 모델이 관찰 데이터 결과의 확률을 계산하는 가능도 함수를 사용한다. 로지스틱 함수는 항상 S-형 곡선을 생성하며, 독립 변수 X의 값에 관계없이 대부분의 경우 영과 일 사이의 합리적인 추정치를 제공한다. 최대 가능도 추정의 목표는 가능도 함수를 최대화하는 일련의 추정값을 찾는 것이다. 이 과정에는 가능도 함수 정의, 로그 가능도 함수 작성, 로그 가능도 함수의 최대값 찾기 등의 단계가 포함된다. 최종적으로, 모델 적합도를 확인하고 최대 가능도 추정을 기반으로 새로운 데이터에 대한 예측을 수행하며 모델의 성능을 다양한 평가 지표로 평가한다. 로지스틱 회귀의 장점에는 모델의 단순함, 낮은 분산, 낮은 편향, 확률 제공 등이 있지만, 비선형 관계 모델링 불가, 클래스가 잘 분리된 경우 불안정, 두 개 이상의 클래스가 있는 경우 불안정 등의 단점도 있다.",
            "timestamp": "020020",
            "summarization": "로과학, 의학, 공학 등 다양한 분야에서 널리 사용되고 있는 로지스틱 회귀는 주어진 변수의 데이터 세트에 대한 특정 클래스에 속하는 사건, 관측치의 조건부 확률을 모델링하는 지도 분류 기법으로써, 로지스틱 회귀는 주어진 변수의 데이터 세트에 대한 특정 클래스에 속하는 사건, 관측치의 조건부 확률을 모델링하는 지도 분류 기법이다."
        },
        {
            "id": "Case Study with Linear Regression",
            "text": "선형 회귀는 단순하지만 강력하며 데이터 과학 및 기계 학습 프로젝트에서 시작하기에 적합한 도구로, 데이터의 중요한 특성을 파악하고 미래를 예측하는 데 사용됩니다. 이 프로젝트는 캘리포니아 주택 가격의 동인을 찾는 것을 목표로 하며, 데이터를 정제하고 주요 경향을 시각화하는 과정을 통해 다양한 파이썬 라이브러리를 사용하여 데이터 처리 방법을 학습합니다. 선형 회귀를 파이썬에서 구현하고 데이터 과학 프로젝트를 수행하기 위해 필요한 기본 단계를 익히게 됩니다. 이 과정을 통해 pandas, scikit-learn, statsmodels, matplotlib, seaborn 등의 데이터 과학 및 기계 학습에 관련된 다양한 파이썬 라이브러리를 다루게 되며, 이 프로젝트를 개인 웹사이트와 이력서에 포함시킬 수 있게 됩니다. 예측 분석 및 인과 분석 분야의 사례 연구를 통해, 선형 회귀를 사용하여 캘리포니아 주택 가치를 정의하는 특성을 식별하는 과정을 단계별로 실습합니다. 데이터 로딩 및 처리, 누락 데이터 분석, 이상치 탐지 및 제거, 데이터 시각화, 상관 관계 분석을 포함한 체계적 접근 방식을 통해, 사례 연구의 본질을 이해하고 다중 선형 회귀를 수행하여 캘리포니아 주택 블록의 가치를 정의하는 특성을 식별합니다. 구글 클라우드와 GitHub를 활용한 코딩 과정에서 필요한 파이썬 라이브러리를 불러오고, 데이터 랭글링, 배열 처리, 통계 모델링 등의 다양한 데이터 과학 기술을 적용하며, 선형 회귀를 통한 인과 분석과 예측 분석을 위해 scikit-learn 및 statsmodels.api 라이브러리를 사용하는 방법을 학습합니다. 이 프로젝트는 데이터 과학 및 기계 학습에 대한 실습 경험을 제공하고, 학습자가 이 분야의 기본 개념과 기술을 탄탄히 다질 수 있는 기회를 제공합니다.",
            "timestamp": "021537",
            "summarization": "선형 회귀를 파이썬에서 구현하고 데이터 과학 프로젝트를 수행하기 위해 필요한 기본 단계를 익히게 되는 이 프로젝트는 학습자에게 데이터 과학 및 기계 학습에 대한 실습 경험 제공과 기본 개념과 기술을 탄탄히 다질 수 있는 기회를 제공한다."
        },
        {
            "id": "Loading and Exploring Data",
            "text": "데이터를 로드하는 과정에서 Google Cloud의 특정 폴더에 'housing.csv' 파일을 저장하였으며, 이 데이터는 지정된 페이지에서 다운로드할 수 있다. 해당 데이터(409기가바이트)를 다운로드하여 Google Cloud에 업로드하는 과정을 설명하고 있으며, 파일 경로를 복사하여 변수에 할당하는 방법을 제시한다. 이어서, pandas라이브러리의 read_csv 함수를 이용하여 데이터를 로드하는 방법을 소개한다. 데이터 탐색 단계에서는 데이터의 열(컬럼)을 확인하여 경도, 위도, 주택 중위 연령, 총 방 수, 총 침실 수, 인구수, 가구 수, 중위 소득, 주택 가격 중위값, 해안 근접성 등의 변수들이 포함되어 있음을 언급한다. 이러한 변수들의 명명방식이 파이썬에서 일반적으로 사용되는 언더스코어(_)를 포함하고 있으며, 공식 문서와는 다를 수 있지만 의미는 동일함을 설명한다. 특히, 'ocean proximity' 변수는 해안가와의 근접성을 설명하며, 이는 주택 가격에 영향을 줄 수 있는 요소임을 언급한다. 코드 실행을 통해 얻은 데이터의 상위 10행을 검토하며, 이를 통해 얻은 주요 정보를 요약한다. 이 과정은 파이썬을 이용한 선형 회귀 모델 구축에 있어 데이터 처리 및 준비의 중요한 단계임을 강조한다.",
            "timestamp": "023344",
            "summarization": "파이썬은 선형 회귀 모델 구축에 있어 데이터 처리 및 준비의 중요한 단계임을 강조하면서 'ocean proximity' 변수는 해안가와의 근접성을 설명하며, 이는 주택 가격에 영향을 줄 수 있는 요소임을 언급하고 이 과정은 파이썬을 이용한 선형 회귀 모델 구축에 있어 데이터 처리 및 준비의 중요한 단계임을 설명한다."
        },
        {
            "id": "Defining Independent and Dependent Variables",
            "text": "다변량 선형 회귀는 하나 이상의 독립 변수가 있을 때 사용되며, 이 경우 독립 변수는 주택 설명에 사용되는 여러 특성들을 의미하고, 의존 변수는 주택 가격의 중앙값이다. 해당 분석의 목적은 주택 특성이 주택 가격에 어떤 영향을 미치는지, 특정 독립 변수의 단위 변화가 중앙 주택 가치에 어떤 변화를 초래하는지 파악하는 것이다. 선형 회귀의 기본 원리는 모든 독립 변수를 일정하게 유지하고 특정 독립 변수의 단위 변화가 의존 변수에 어떠한 변화를 일으키는지 조사하는 것이다. 또한, 데이터 유형을 식별하고 다음 단계로 넘어가기 전에 데이터에 대해 더 자세히 알아보고자 한다. 이를 위해 pandas의 info 함수를 사용하여 데이터 타입과 변수별 비어 있지 않은 값의 개수를 확인한다. 대부분의 변수는 수치형 데이터이지만, 'ocean_proximity'는 문자열을 사용하는 범주형 변수로, 다섯 가지 고유값을 가지며 해변과의 거리를 설명하는 특성으로, 이는 특정 지역이나 국가에서 해변 근처에 사는 것이 주택 가치에 긍정적이거나 부정적인 영향을 미칠 수 있다는 가정 하에, 주택 가치에 미치는 통계적으로 유의미한 영향이 있는지를 파악하고자 하는 분석의 일부이다. 분석 목적은 주택 가치를 정의하는 특성들이 무엇인지 이해하고, 특정 특성의 단위 증가가 주택 가치에 어떻게 영향을 미치는지 파악함으로써, 주택 가격이 더 높거나 낮아질 수 있는 요소들을 이해하는 것이다.",
            "timestamp": "023954",
            "summarization": "선형 회귀의 기본 원리는 모든 독립 변수를 일정하게 유지하고 특정 독립 변수의 단위 변화가 의존 변수에 어떠한 변화를 일으키는지 조사하는 것으로, 주택 가치를 정의하는 특성들이 무엇인지 이해하고, 특정 특성의 단위 증가가 주택 가치에 어떻게 영향을 미치는지 파악함으로써, 주택 가격이 더 높거나 낮아질 수 있는 요소들을 이해하는 것이다."
        },
        {
            "id": "Data Cleaning and Preprocessing ",
            "text": "데이터 처리를 통해 적합한 기계 학습 모델을 구축하기 위해서 결측값을 확인하고, 이를 처리하는 과정이 필요하다. 결측값이 존재하는 항목과 그 비율을 파악하여, 결측값을 제거하거나 대체(Imputation) 방법을 결정해야 한다. 예를 들어, 전체 데이터에서 'total_bedrooms' 변수의 결측값 비율이 1.003%로 낮으므로, 이 변수를 유지하되 결측값을 가진 관찰치를 제거하거나 대체하는 방법을 고려할 수 있다. 대체 방법으로는 평균, 중앙값 대체 또는 보다 고급 통계적 방법을 사용할 수 있다. 이러한 처리를 통해 결측치를 관리한 후, 데이터 정제를 위해 'drop NA' 함수를 사용하여 결측값을 가진 관찰치를 제거하고, 결측치가 제거됨을 확인한다. 그 다음 단계로, 기술 통계와 데이터 시각화를 통해 데이터를 묘사하고, 데이터 내 패턴, 평균, 표준편차 등을 파악하여 데이터를 이해하는 것이 중요하다. 이 과정은 모델 학습 및 테스트에 앞서 수행되며, 데이터에 대한 깊은 이해를 바탕으로 기계 학습 모델을 훈련하고 검증하는 데 도움이 된다. 데이터 분석 초기 단계에서 실시된 이러한 작업은 모델의 정확성 및 편향을 최소화하는데 기여한다.",
            "timestamp": "024559",
            "summarization": "최 처리를 통해 적합한 기계 학습 모델을 구축하기 위해서 결측값을 확인하고, 이를 처리하는 과정이 필요하는데 결측값이 존재하는 항목과 그 비율을 파악하여, 결측값을 제거하거나 대체(Emputation) 방법을 결정해야 하며 한 단계로, 기술 통계와 데이터 시각화를 통해 데이터를 묘사하고, 데이터 내 패턴, 평균, 표준편차 등을 파악하여 데이터를 이해하는 것이 중요하다."
        },
        {
            "id": "Descriptive Statistics and Data Visualization",
            "text": "본 연구에서는 데이터의 최소값과 최대값을 해석하여 각 수치 데이터 필드에서 관찰될 수 있는 최소 및 최대값을 이해하는 것과, 이로 인해 데이터 필드의 값 범위를 파악하는 데 도움이 됨을 제시하고 있다. 특히 중앙값 주택 가격의 경우, 블록 당 최소 및 최대 중앙값 주택 가격을 통해 가장 저렴한 주택과 가장 비싼 주택이 위치한 블록을 식별할 수 있음을 설명한다. 데이터 시각화 과정에서 중앙값 주택 가격을 대상 변수로 하여 히스토그램을 사용하면 중앙값 주택 가격의 분포와 함께 자주 발생하는 가격과 덜 자주 나타나는 유일한 가격을 포함한 값을 식별할 수 있으며, 이를 통해 데이터 내 이상치를 식별하는 데 도움이 된다고 언급한다. 또한, Seaburn 라이브러리를 활용한 시각화 기법을 통해 필요한 데이터, 함수 설정, 변수 지정, 타이틀 및 레이블 추가 후 시각화 결과를 보여주는 과정을 설명하며, 이러한 시각화 기법이 데이터 과학에 있어 중요한 역할을 한다고 강조한다. 데이터 집합 전체에서 중앙값 주택 가격의 출현 빈도를 시각화하고 분석하여 일반적으로 관찰되는 가격 범위와 비정상적으로 높거나 낮은 가격으로 간주될 수 있는 이상치를 식별하는 방법을 제공한다. 또한, 중앙값 주택 가격이 특정 범위를 벗어나는 경우, 이들을 이상치로 간주하고 분석에서 제외하는 방법으로 사분위수 범위를 사용하는 전략을 설명한다. 이 연구는 1990년 데이터를 기반으로 하며, 현재의 캘리포니아 주택 가격과는 차이가 있음을 명시하고, 이러한 데이터 시각화 및 분석 기법이 데이터 과학의 이해와 적용을 향상시키는 데 기여할 수 있음을 주장한다.",
            "timestamp": "025439",
            "summarization": "본 시각화 기법을 통해 필요한 데이터, 함수 설정, 변수 지정, 타이틀 및 레이블 추가 후 시각화 결과를 보여주는 과정을 보여주는 과정을 설명하며, 이러한 시각화 및 분석 기법이 데이터 과학의 이해와 적용을 향상시키는 데 기여할 수 있음을 강조하고, 1990년 데이터를 기반으로 하며, 현재의 캘리포니아 주택 가격과는 차이가 있음을 명시하며, 이러한 데이터 시각화 및 분석 기법이 데이터 과학의 이해와 적용을 향상시키는 데 기여할 수 있음을 주장한다."
        },
        {
            "id": "InterQuantileRange for Outlier Detection",
            "text": "본 연구에서는 주택 가격 데이터의 이상값을 제거하는 과정을 수행하였다. 첫번째 단계로, 주택 가격의 하위 25% 이상 및 상위 25% 미만에 해당하는 데이터를 유지하기로 결정하였으며, 이를 위해 판다스의 quantile 함수를 사용하여 1분위수(Q1) 및 3분위수(Q3)를 계산하였다. Q1은 주택 가격이 하위 25%에 해당하는 경계값을, Q3는 주택 가격이 상위 25%를 구분하는 경계값을 나타낸다. 이러한 경계값을 활용하여, 데이터에서 이상값을 제거하는 작업을 수행하였다. 간극(IQR)은 Q3에서 Q1을 뺀 값으로, 이 값을 1.5배 하여 하한선과 상한선을 계산하고, 이를 기준으로 이상값을 제거함으로써 최종적으로 정제된 데이터를 얻을 수 있다. 이 방법을 통해 처음에 20,433개의 관측치가 있었던 것에서 19,369개의 관측치로 데이터가 축소되었다. 중간 소득 데이터에서도 유사한 방법을 적용하여 이상치를 식별하고 제거하는 과정을 진행하였다. 이상치 제거 후의 데이터는 보다 정확하게 평균적이거나 정상적인 주택 가격과 소득 수준을 반영한다고 볼 수 있으며, 이는 공통된 특성이나 기준을 정의하고자 할 때 중요한 과정이다. 데이터 정제 과정을 통해 얻은 결과물은 주택 가치 결정에 있어 보다 일반적인 특성을 식별하는 데 도움을 줄 수 있다.",
            "timestamp": "030339",
            "summarization": "본 연구에서 주택 가격 데이터의 이상값을 제거하는 과정의 첫 단계로, 주택 가격의 하위 25% 이상 및 상위 25% 미만에 해당하는 데이터를 유지하기로 결정하였으며, 이를 위해 판다스의 quantile 함수를 사용하여 1분위수(Q1) 및 3분위수(Q3)를 계산하였고 중간 소득 데이터에서도 유사한 방법을 적용하여 이상치를 식별하고 제거하는 과정을 진행하였다."
        },
        {
            "id": "Correlation Analysis",
            "text": "특히 회귀 분석과 코사인 분석에서 변수 쌍 간의 상관 관계 점수를 계산하여 상관 관계 행렬을 얻는 과정을 말하며, 선형 회귀의 가정 중 하나는 독립 변수 간에 높은 상관 관계가 없어야 한다는 것입니다. 상관 관계 히트맵은 문제가 될 수 있는 독립 변수를 식별하는 데 유용한 방법으로, 독립 변수 간에 높은 상관 관계가 있는 경우 멀티콜리니어리티를 다루고 있을 수 있음을 의미합니다. C-burn을 사용하여 히트맵을 작성하면, 음의 상관 관계를 가리키는 밝은 색부터 긍정적인 상관 관계를 나타내는 어두운 녹색까지 다양한 색상을 볼 수 있습니다. 또한, 독립 변수는 유사한 정보를 함유하고 있기 때문에 높은 상관 관계를 가진 변수 중 하나를 제거하는 것을 고려할 수 있습니다. 총 침실 수와 세대 수는 긍정적으로 상관 관계가 높아 이 중 하나를 제거함으로써 완벽한 멀티콜리니어리티를 피할 수 있습니다. 카테고리 변수에 대해서는 원-핫 인코딩 대신 더미 변수를 생성해 선형 회귀 모델에 적용하는 것이 권장되며, 멀티콜리니어리티를 피하기 위해 하나의 카테고리를 제외시켜야 합니다. 머신 러닝 모델 훈련을 위해서는 데이터를 훈련 세트와 테스트 세트로 나누고, 모델의 훈련에는 독립 변수 세트와 종속 변수, 즉 목표 변수인 중간 주택 가격을 사용합니다. 이는 블록 내 주택의 특성이 중간 주택 가치에 미치는 영향을 식별하고자 하는 목적을 가지고 있습니다.",
            "timestamp": "031400",
            "summarization": "상별 관계 히트맵은 문제가 될 수 있는 독립 변수를 식별하는 데 유용한 방법으로, 문제가 될 수 있는 독립 변수를 식별하는 데 유용한 방법으로, 문제가 될 수 있는 독립 변수를 식별하는 데 유용한 방법으로, 문제가 될 수 있는 독립 변수 간에 높은 상관 관계가 있는 경우 멀티콜리니어리티를 다루고 있을 수 있음을 의미하며, 머신 러닝 모델 훈련을 위해서는 데이터를 훈련 세트와 테스트 세트로 나누고, 모델의 훈련에는 독립 변수 세트와 종속 변수, 즉 목표 변수인 중간 주택 가격을 사용해야 한다."
        }
    ]
}